---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DirectShapeTypeOptions Properties
DirectShapeTypeOptions Class See Also Send Feedback
---

The DirectShapeTypeOptions type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | AllowDuplicateNames | Determines whether or not duplicate DirectShapeType names are allowed. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

DirectShapeTypeOptions Class

Autodesk.Revit.DB Namespace